// У нас есть график, где даны отрезок 1 - (x1, x2) и отрезок 2 (x3, x4)
//Необходимо составить код, кот находит их пересечение
//Пересечением двух отрезков м.б. : отрезок, точка или ничего
// С клавиатуры вводим х1, х2, х3, х4 и выводим ответ - границы пересечения отрезков,
// общую точку или "не пересекаются"

Console.Write("Введите первое число (Х1): ");
int x1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число (Х2): ");
int x2 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число (Х3): ");
int x3 = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите первое число (Х4): ");
int x4 = Convert.ToInt32(Console.ReadLine());

